	ori  $t0,$0,1     	#t0=1
     	ori  $t1,$0,3     	#t1=3
     	sw   $t0,0x00002000     	#t0存入第一个内存
     	lw   $t2,0x00002000     	#取出内存中的数：t2=1
     	addu $t3,$t2,$t0      	#t3=t0+t2=2
     	subu $t4,$t1,$t2      	#t4=t1-t2=2 
     	lui  $t5,3     		#将3加载t5的高位
    	beq  $t3,$t4,go1    	#判断t3 t4 是否相等，相等转移
     	subu $t0,$t1,$t0   	#t0=t1-t0=2
    	ori  $t1,$0,5		#t1=5
go1:  	ori  $s0,$0,6           	#s0=6
    	sw   $s0,0x00002020  	#6存入第二个内存
     	lw   $s1,0x00002000  	#取出第一个内存中的数：s1=1
     	subu $s2,$s0,$t1   	#s2=6-3=3
     	beq  $t1,$s0,go2		#如果t1=s0（=3），转到go2
     	lui  $s0,3           	#3加载到s0的高位
go2:     addu $s3,$t2,$t3   	#s3=1+2=3
     	lw   $s4,0x00002020  	#s4=6
     	ori  $s5,$0,6           	#s5=6
     	addu $s5,$s3,$s4   	#s5=3+6=9
